#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ALX-Terraform-Labs/demo-giithub-actions/runs/run-Se9aX3JzWYdw2pDN

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=ideal-hog]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0977ea85f9f5d007c]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08dd49d6eb17e0547]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-088e4371aa68f0cae]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ec1a6aad005f0de6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0febae8fe45f7135e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01bccfb27a67d6179]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-043c5bd5dc088c17f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de5aaac0e7567aa3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c7b69b241dff9c85]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fef6a84f9c977bc3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cc9a7aa4cf284b24]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03e99b63895be76d2]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1f983ff0cb4999d]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c2c3325fc4127df6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0757f6dd10bbe4865]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08a9b229118a8db54]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-070277783dc500e5a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cc9a7aa4cf284b241080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0febae8fe45f7135e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ec1a6aad005f0de61080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-073fa29e6655b219a"
        id                   = "eipalloc-088e4371aa68f0cae"
      + network_interface    = "eni-0792ac7d9548fc64f"
      + private_dns          = "ip-10-0-101-8.us-west-2.compute.internal"
      + private_ip           = "10.0.101.8"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "example-vpc-us-west-2a"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0c0f54af580ef619d"
        id                   = "eipalloc-08dd49d6eb17e0547"
      + network_interface    = "eni-048cd3a767e6b5a60"
      + private_dns          = "ip-10-0-102-109.us-west-2.compute.internal"
      + private_ip           = "10.0.102.109"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "example-vpc-us-west-2b"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0febae8fe45f7135e"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0757f6dd10bbe4865"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "example-vpc-private-us-west-2a"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0ec1a6aad005f0de6"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0c2c3325fc4127df6"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "example-vpc-private-us-west-2b"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0cc9a7aa4cf284b24"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-01bccfb27a67d6179"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "example-vpc-public"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-830c94e3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "dece31035f1c0b04df1feac69fbe484b38969f38"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "ideal-hog-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0977ea85f9f5d007c"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pusher: @alexbatistasp, Action: `pull_request`*